АлогистикТест2/src/DataProcessors/алк_РМ_ОператораРебросклей/алк_РМ_ОператораРебросклей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_ОператораРебросклей</name>
  <comment>выпуск ребросклея</comment>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Толщина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомерПередача</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПередача</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПередача</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатПередача</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ВидыСечений/ВидыСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСечений</name>
  <enumValues>
    <name>Квадратное</name>
  </enumValues>
  <enumValues>
    <name>Круглое</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/ФиксированныеДопРеквизиты/ФиксированныеДопРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФиксированныеДопРеквизиты</name>
  <enumValues>
    <name>Порода</name>
  </enumValues>
  <enumValues>
    <name>Сорт</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>Сечение</name>
  </enumValues>
  <enumValues>
    <name>Влажность</name>
  </enumValues>
  <enumValues>
    <name>Поверхность</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_СтатусыОтчетаПроизводства/алк_СтатусыОтчетаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыОтчетаПроизводства</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Заблокирован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_Производство/алк_Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Производство</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыОтчетаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/DataProcessors/алк_РМ_ОператораРебросклей/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	//Заполним ДатаСмены и Смена автоматом
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;

	//Заполним Основные реквизиты автоматом
	Объект.Операция = Справочники.алк_ОперацииПроизводства.Ребросклей;	
	Объект.Номенклатура = Объект.Участок.НоменклатураВыпуска;
	
	//Установим доступность зависящую от участка
	ДоступностьОтУчастка = ЗначениеЗаполнено(Объект.Участок);
	Элементы.ДлинаНовый.Доступность = ДоступностьОтУчастка;
	Элементы.СертификатНовый.Доступность = ДоступностьОтУчастка;
	//Старый интерфейс
	Элементы.Длина.Доступность = ДоступностьОтУчастка;
	Элементы.Сертификат.Доступность = ДоступностьОтУчастка;
	//\\
	
	//Настроим параметры выбора сертификата и длины
	НовыйПараметрСертификата = Новый ПараметрВыбора("Отбор.КатегорияНоменклатуры", Объект.Номенклатура.КатегорияНоменклатуры);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметрСертификата);
	ПараметрыВыбораСертификата = Новый ФиксированныйМассив(НовыйМассив);
		
	НовыйПараметрДлины = Новый ПараметрВыбора("Отбор.Владелец", Объект.Номенклатура.КатегорияНоменклатуры);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметрДлины);
	ПараметрыВыбораДлины = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.СертификатНовый.ПараметрыВыбора = ПараметрыВыбораСертификата;
	Элементы.ДлинаНовый.ПараметрыВыбора = ПараметрыВыбораДлины;
	Элементы.СортНовый.ПараметрыВыбора = ПараметрыВыбораДлины;

	//Старый интерфейс
	Элементы.Сертификат.ПараметрыВыбора = ПараметрыВыбораСертификата;
	Элементы.Длина.ПараметрыВыбора = ПараметрыВыбораДлины;
	Элементы.Сорт.ПараметрыВыбора = ПараметрыВыбораДлины;
	//\\
	
	ОбновитьБригаду();
	ОбновитьПараметрыДинамическихСписков();

	СписокПодобныхСерийныхНомеров.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Номенклатура);
	СписокПодобныхСерийныхНомеров.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Объект.Участок.СкладСписания);
	НомерПакетаИзменениеТекстаРедактированияНаСервере("0");
	
КонецПроцедуры

Процедура ОбновитьПараметрыДинамическихСписков()
	
	СформированныеПакетыВыпуска.Параметры.УстановитьЗначениеПараметра("Смена", Объект.Смена);
	СформированныеПакетыВыпуска.Параметры.УстановитьЗначениеПараметра("ДатаСмены", Объект.ДатаСмены);
	СформированныеПакетыВыпуска.Параметры.УстановитьЗначениеПараметра("Операция", Объект.Операция);
	СформированныеПакетыВыпуска.Параметры.УстановитьЗначениеПараметра("Участок", Объект.Участок);
	
	СформированныеПакетыПередачи.Параметры.УстановитьЗначениеПараметра("Смена", Объект.Смена);
	СформированныеПакетыПередачи.Параметры.УстановитьЗначениеПараметра("ДатаСмены", Объект.ДатаСмены);
	СформированныеПакетыПередачи.Параметры.УстановитьЗначениеПараметра("Операция", Объект.Операция);
	СформированныеПакетыПередачи.Параметры.УстановитьЗначениеПараметра("Участок", Объект.Участок);


	РасчитатьИтогиВыпущеныхПакетов();
	РасчитатьИтогиПереданыхПакетов();
	
КонецПроцедуры

Процедура РасчитатьИтогиВыпущеныхПакетов() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ПроизводствоПродукция.СерийныйНомер) КАК КоличествоСтрок,
		|	СУММА(алк_ПроизводствоПродукция.Количество) КАК СуммаКоличество,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
		|				ТОГДА ВЫРАЗИТЬ(алк_ПроизводствоПродукция.Количество / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(10, 0))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКоличествоЛистов
		|ИЗ
		|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ПроизводствоПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ПроизводствоПродукция.Ссылка.Смена = &Смена
		|	И алк_ПроизводствоПродукция.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_ПроизводствоПродукция.Ссылка.Участок = &Участок
		|	И алк_ПроизводствоПродукция.Ссылка.Операция = &Операция";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Операция", Объект.Операция);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("Участок", Объект.Участок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоСтрок = ВыборкаДетальныеЗаписи.КоличествоСтрок;	
		СуммаКоличество = ВыборкаДетальныеЗаписи.СуммаКоличество;
		СуммаКоличествоЛистов = ВыборкаДетальныеЗаписи.СуммаКоличествоЛистов;
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчитатьИтогиПереданыхПакетов() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ПроизводствоМатериалы.СерийныйНомер) КАК КоличествоСтрок,
		|	СУММА(алк_ПроизводствоМатериалы.Количество) КАК СуммаКоличество,
		|	СУММА(ВЫРАЗИТЬ(алк_ПроизводствоМатериалы.Количество / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(10, 0))) КАК СуммаКоличествоЛистов
		|ИЗ
		|	Документ.алк_Производство.Материалы КАК алк_ПроизводствоМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ПроизводствоМатериалы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ПроизводствоМатериалы.Ссылка.Смена = &Смена
		|	И алк_ПроизводствоМатериалы.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_ПроизводствоМатериалы.Ссылка.Участок = &Участок
		|	И алк_ПроизводствоМатериалы.Ссылка.Операция = &Операция";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Операция", Объект.Операция);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("Участок", Объект.Участок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоСтрокПередано = ВыборкаДетальныеЗаписи.КоличествоСтрок;	
		СуммаКоличествоПередано = ВыборкаДетальныеЗаписи.СуммаКоличество;
		СуммаКоличествоЛистовПередано = ВыборкаДетальныеЗаписи.СуммаКоличествоЛистов;
	КонецЦикла;
 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Установим интерфейс
	Элементы.ГруппаНовыйИнтерфейс.Видимость = НЕ ПереключательИнтерфейса;
	Элементы.ГруппаСтарыйИнтерфейс.Видимость = ПереключательИнтерфейса;
	
	//Заголовок
	Если Объект.Операция = ПредопределенноеЗначение("Справочник.алк_ОперацииПроизводства.Ребросклей") Тогда
		ЭтаФорма.Заголовок = "Выпуск ребросклея";
	ИначеЕсли Объект.Операция = ПредопределенноеЗначение("Справочник.алк_ОперацииПроизводства.Сушка") Тогда
		ЭтаФорма.Заголовок = "Сортировка";
	КонецЕсли;
	
	ПриОткрытииНаСервере();
	
	//Получим Характеристику
	ПолучитьХарактеристику();
	ОбновитьНадписьСечения();
	
	ОбновитьЗаголовокСтраницыВыпущено();
	ОбновитьЗаголовокСтраницыПередано();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыВыпущено() 
	Элементы.Выпущено.Заголовок = СтрШаблон("Выпущено: %1 пак. / %2 лист. / %3 м³", КоличествоСтрок, СуммаКоличествоЛистов, СуммаКоличество);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыПередано() 
	Элементы.Передано.Заголовок = СтрШаблон("Передано: %1 пак. / %2 лист. / %3 м³", КоличествоСтрокПередано, СуммаКоличествоЛистовПередано, СуммаКоличествоПередано);
КонецПроцедуры

&НаСервере
Процедура ОбновитьБригаду()
	Объект.Бригада = алк_ПроизводствоСервер.ПолучитьБригадуПоСменеИУчастку(Объект.ДатаСмены, Объект.Смена, Объект.Участок);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПакет(Команда)	
	
	ОчиститьСообщения();
	ОбновитьБригаду();

	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
	
	Если Объект.ДатаСмены = НачалоДня(ПараметрыСменыПоТекущейДате.ДатаСмены) 
		И Объект.Смена = ПараметрыСменыПоТекущейДате.Смена Тогда 
	
		ДобавитьПакетВПроизводство("Выпуск");
		Если Успех Тогда
			ВопросАсинх("", РежимДиалогаВопрос.ОК, 5, КодВозвратаДиалога.ОК , "Пакет успешно создан", КодВозвратаДиалога.ОК);
		КонецЕсли;
		ОбновитьНадписьСечения();	
	Иначе
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена"); 
		Объект.СерийныйНомер = Объект.СерийныйНомер.Пустая();
		ВопросАсинх("Проверьте параметры рабочего места и повторно нажмите кнопку ""Создать пакет""." + Символы.ПС + "Если пакет относится к прошлой смене, тогда обратитесь к мастеру", РежимДиалогаВопрос.ОК, , КодВозвратаДиалога.ОК , "Началась новая смена", КодВозвратаДиалога.ОК);
	КонецЕсли;
	
	ОбновитьПараметрыДинамическихСписков();
	ОбновитьЗаголовокСтраницыВыпущено();	
КонецПроцедуры

Функция СоздатьХарактеристику()
	
	Если НЕ ЗначениеЗаполнено(Сечение) Тогда		
		НовоеСечение = Справочники.РазмерСечения.СоздатьЭлемент();
		НовоеСечение.Владелец = Объект.Номенклатура.КатегорияНоменклатуры;
		НовоеСечение.ВидСечения = Перечисления.ВидыСечений.Квадратное;
		НовоеСечение.ШиринаММ = Объект.Ширина;
		НовоеСечение.ТолщинаММ = Объект.Толщина;
		
		Попытка
			НовоеСечение.Записать();		
			
			Сечение = НовоеСечение.Ссылка;		
			Сообщить(СтрШаблон("Сечение %1 успешно создано", Сечение));
		Исключение	
			Сообщить(ОписаниеОшибки());		
			Возврат Ложь;		
		КонецПопытки;
	КонецЕсли;
	
	ТаблицаСвойствИЗначений = ПолучитьТаблицуСвойствЗначений();
	Объект.Характеристика = АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(Объект.Номенклатура, ТаблицаСвойствИЗначений);		
	
	Если НЕ Объект.Характеристика = Неопределено И НЕ Объект.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда 
		Сообщить(СтрШаблон("Характеристика %1 успешно создана", Объект.Характеристика));
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Процедура ПолучитьХарактеристику()
	
	//Если ЗначениеЗаполнено(Объект.Длина) И ЗначениеЗаполнено(Объект.Ширина) И ЗначениеЗаполнено(Объект.Толщина) И ЗначениеЗаполнено(Объект.Сорт) Тогда
		ТаблицаСвойствИЗначений = ПолучитьТаблицуСвойствЗначений();		
		Объект.Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(Объект.Номенклатура, ТаблицаСвойствИЗначений);		
	//Иначе
	//	Возврат;
	//КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуСвойствЗначений()
	//Обнулим Сечение
	Сечение = Неопределено;
	
	//Получим сечение	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмерСечения.Ссылка
	|ИЗ
	|	Справочник.РазмерСечения КАК РазмерСечения
	|ГДЕ
	|	РазмерСечения.Владелец = &КатегорияНоменклатуры
	|	И РазмерСечения.ШиринаММ = &ШиринаММ
	|	И РазмерСечения.ТолщинаММ = &ТолщинаММ";
	
	Запрос.УстановитьПараметр("КатегорияНоменклатуры", Объект.Номенклатура.КатегорияНоменклатуры);
	Запрос.УстановитьПараметр("ТолщинаММ", Объект.Толщина);
	Запрос.УстановитьПараметр("ШиринаММ", Объект.Ширина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сечение = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
	ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
	ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
	
	пвхПорода    = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
	пвхСорт      = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
	пвхДлина     = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
	пвхСечение   = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
	//пвхВлажность = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность);	
	
	НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
	НоваяСтрокаСвойств.Свойство = пвхПорода;
	НоваяСтрокаСвойств.Значение = Объект.Порода;
	
	НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
	НоваяСтрокаСвойств.Свойство = пвхСорт;
	НоваяСтрокаСвойств.Значение = Объект.Сорт;
	
	НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
	НоваяСтрокаСвойств.Свойство = пвхДлина;
	НоваяСтрокаСвойств.Значение = Объект.Длина;
	
	НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
	НоваяСтрокаСвойств.Свойство = пвхСечение;
	НоваяСтрокаСвойств.Значение = Сечение;
	
	Возврат ТаблицаСвойствИЗначений; 
	
КонецФункции

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	ПолучитьХарактеристику();
	ОбновитьНадписьСечения();
	РасчитатьОбъемКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	ПолучитьХарактеристику();
	ОбновитьНадписьСечения();
	РасчитатьОбъемКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаПриИзменении(Элемент)
	ПолучитьХарактеристику();
	ОбновитьНадписьСечения();
	РасчитатьОбъемКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьСечения()
	Если НЕ ЗначениеЗаполнено(Сечение) Тогда
		Элементы.НадписьСечение.ЦветТекста = WebЦвета.Кирпичный;
		Элементы.НадписьСечение.Заголовок = "Сечение не определено, будет создано новое";
		Элементы.НадписьСечениеНовый.ЦветТекста = WebЦвета.Кирпичный;
		Элементы.НадписьСечениеНовый.Заголовок = "Сечение не определено, будет создано новое";
	Иначе
		Элементы.НадписьСечение.ЦветТекста = WebЦвета.Синий;
		Элементы.НадписьСечение.Заголовок = "Сечение: " + Строка(Сечение);
		Элементы.НадписьСечениеНовый.ЦветТекста = WebЦвета.Синий;
		Элементы.НадписьСечениеНовый.Заголовок = "Сечение: " + Строка(Сечение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	РасчитатьОбъемКоличество();	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемНовыйПриИзменении(Элемент)
	РасчитатьОбъемКоличество();
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьОбъемКоличество()
	Если ЗначениеЗаполнено(Объект.Сорт) Тогда
		Если РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Объект.Сорт, "РучнойВводОбъема") Тогда
			//Расчитаем количество
			ДлинаММ = ?(ЗначениеЗаполнено(Объект.Длина), РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Объект.Длина, "ДлинаММ"), 0);
			Если ДлинаММ = 0 ИЛИ Объект.Толщина = 0 ИЛИ Объект.Ширина = 0 Тогда
				Объект.Количество = 0;
			Иначе
				Объект.Количество = (Объект.Объем * 1000000000) / (ДлинаММ * Объект.Толщина * Объект.Ширина);
			КонецЕсли;
		Иначе
			//Расчитаем объем
			ДлинаММ = ?(ЗначениеЗаполнено(Объект.Длина), РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Объект.Длина, "ДлинаММ"), 0);
			Объект.Объем = (Объект.Количество * ДлинаММ * Объект.Толщина * Объект.Ширина) / 1000000000;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	ПриОткрытииНаСервере();
	ОбновитьЗаголовокСтраницыВыпущено();
	ОбновитьЗаголовокСтраницыПередано() ;		
	Объект.Длина = Объект.Длина.Пустая();
	Объект.Сертификат = Объект.Сертификат.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура ПородаПриИзменении(Элемент)
	ПолучитьХарактеристику();
	ОбновитьНадписьСечения();
	РасчитатьОбъемКоличество();
КонецПроцедуры

&НаКлиенте
Процедура СортПриИзменении(Элемент)
	
	Если РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Объект.Сорт, "РучнойВводОбъема") Тогда
		Элементы.Объем.ТолькоПросмотр = Ложь;
		Элементы.Количество.ТолькоПросмотр = Истина;
		Элементы.ОбъемНовый.ТолькоПросмотр = Ложь;
		Элементы.КоличествоНовый.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ОбъемНовый.ТолькоПросмотр = Истина;
		Элементы.КоличествоНовый.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
	ПолучитьХарактеристику();
	ОбновитьНадписьСечения();	
	РасчитатьОбъемКоличество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательИнтерфейсаПриИзменении(Элемент)	
	ПриОткрытии(Ложь);		
	//Сделать запись журнал для статистики
	ЗаписатьПереключенияИнтерфейсаВЖурналРегистрации();		
КонецПроцедуры

Процедура ЗаписатьПереключенияИнтерфейсаВЖурналРегистрации()
	Если ПереключательИнтерфейса Тогда
		ЗаписьЖурналаРегистрации("ОператорСортировкиВключилСтарыйИнтерфейс", УровеньЖурналаРегистрации.Информация);	
	Иначе
		ЗаписьЖурналаРегистрации("ОператорСортировкиВключилНовыйИнтерфейс", УровеньЖурналаРегистрации.Информация);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПрограмму(Команда)
	ЗавершитьРаботуСистемы();
КонецПроцедуры

#Область Передано

&НаСервере
Процедура НомерПакетаИзменениеТекстаРедактированияНаСервере(Текст)
	СписокПодобныхСерийныхНомеров.Параметры.УстановитьЗначениеПараметра("ПодобныйНомер", "%" + ФОРМАТ(Число(?(Текст = "", 999999, Текст)),"ЧЦ=6; ЧВН=; ЧГ=0")); //Число с лидирующими нулями	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодобныхСерийныхНомеровПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Элемент.ТекущиеДанные);
	Иначе
		СбросВыбраныхЗначений();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерПакетаПриИзменении(Элемент)
	НомерПакетаИзменениеТекстаРедактированияНаСервере(НомерПакета); 	
КонецПроцедуры

&НаКлиенте
Процедура НомерПакетаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	НомерПакетаИзменениеТекстаРедактированияНаСервере(Текст);
	НомерПакета = Текст;	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьНаСушку(Команда)
	
	ОчиститьСообщения();
	ОбновитьБригаду();

	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
	
	Если Объект.ДатаСмены = НачалоДня(ПараметрыСменыПоТекущейДате.ДатаСмены)
		И Объект.Смена = ПараметрыСменыПоТекущейДате.Смена Тогда 
	
		//Если ПроверитьЗаполнение() Тогда
			ДобавитьПакетВПроизводство("Передача");
			Если УспехПередано Тогда
				СбросВыбраныхЗначений();
				Элементы.СписокПодобныхСерийныхНомеров.Обновить();
				ВопросАсинх("", РежимДиалогаВопрос.ОК, 5, КодВозвратаДиалога.ОК , "Пакет передан", КодВозвратаДиалога.ОК);
			КонецЕсли;
		//КонецЕсли;
	
	Иначе
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена"); 
		Объект.СерийныйНомер = Объект.СерийныйНомер.Пустая();
		ВопросАсинх("Проверьте параметры рабочего места и повторно нажмите кнопку ""Передать""." + Символы.ПС + "Если пакет относится к прошлой смене, тогда обратитесь к мастеру", РежимДиалогаВопрос.ОК, , КодВозвратаДиалога.ОК , "Началась новая смена", КодВозвратаДиалога.ОК);
	КонецЕсли;
	
	ОбновитьПараметрыДинамическихСписков();
	ОбновитьЗаголовокСтраницыПередано();	
КонецПроцедуры

&НаКлиенте
Процедура СбросВыбраныхЗначений()
	//Сбросим серийный номер и все сопутствующие ему
	Объект.СерийныйНомерПередача = Объект.СерийныйНомерПередача.Пустая();
	Объект.ХарактеристикаПередача = Объект.ХарактеристикаПередача.Пустая();
	Объект.СертификатПередача = Объект.СертификатПередача.Пустая();
	Объект.КоличествоПередача = 0;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ДобавитьПакетВПроизводство(РежимДобавления) 
	
	Успех = Истина;
	//Получим документ производства
	ПараметрыПроизводства = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	ПараметрыПроизводства.Участок = Объект.Участок;
	ПараметрыПроизводства.Операция = Объект.Операция;
	ПараметрыПроизводства.ДатаСмены = Объект.ДатаСмены;
	ПараметрыПроизводства.Смена = Объект.Смена;
	
	ДокументТекущегоПроизводства = алк_ПроизводствоСервер.ПолучитьДокументПроизводстваТекущейСмены(ПараметрыПроизводства, Истина);
	
	//Проверим его статус
	Если ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Закрыт Тогда
		Сообщить("Ошибка! Смена закрыта мастером. Создание новых пакетов запрещено в закрытой смене. Возможно неверно заполнены реквизиты смены. Проверьте реквизиты смены или обратитесь в мастеру");
		Успех = Ложь;
		УспехПередано = Ложь;
		Возврат;
	ИначеЕсли ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Заблокирован Тогда
		Сообщить("Ошибка! Мастер заблокировал документ. Дождитесь разблокировки или обратитесь в мастеру");
		Успех = Ложь;
		УспехПередано = Ложь;
		Возврат;
	КонецЕсли;

	Период = ТекущаяДата();
	ПараметрыПакета = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_ДобавитьСписатьПакет();
	
	Если РежимДобавления = "Выпуск" Тогда
		Если ЗначениеЗаполнено(Объект.Количество)
			И ЗначениеЗаполнено(Объект.Порода)
			И ЗначениеЗаполнено(Объект.Длина) 
			И ЗначениеЗаполнено(Объект.Сорт) 
			И ЗначениеЗаполнено(Объект.Ширина)
			И ЗначениеЗаполнено(Объект.Толщина) 
			И ЗначениеЗаполнено(Объект.Объем) Тогда
			
			//Генерируем Серийный номер
			НовыйСерийныйНомер = алк_ПроизводствоСервер.СгенерироватьНовыйСерийныйНомер(Объект.Номенклатура, НачалоГода(ДокументТекущегоПроизводства.Ссылка.Дата));
			Если НовыйСерийныйНомер = Неопределено Тогда	
				Успех = Ложь;
				Возврат;
			Иначе
				Объект.СерийныйНомер = НовыйСерийныйНомер;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Характеристика) И НЕ СоздатьХарактеристику() Тогда
				Успех = Ложь;
				Возврат;	
			КонецЕсли;					
			
			ПараметрыПакета.ТипЗаполнения = "ДобавитьПакет";
			ПараметрыПакета.Количество = Объект.Объем;
			ПараметрыПакета.Номенклатура = Объект.Номенклатура;
			ПараметрыПакета.Период = Период;
			ПараметрыПакета.СерийныйНомер = Объект.СерийныйНомер;
			ПараметрыПакета.Сертификат = Объект.Сертификат;
			ПараметрыПакета.Характеристика = Объект.Характеристика;
			ПараметрыПакета.Склад = Объект.Участок.СкладВыпуска;
		Иначе 
			Если Не ЗначениеЗаполнено(Объект.Объем) Тогда  
				Сообщить("Введены не корректные данные для расчета объема пакета! Проверьте заполнение!");
			Иначе
				Сообщить("Заполните обязательные поля!"); 
			КонецЕсли;
			Успех = Ложь;
			Возврат;
		КонецЕсли;		
	ИначеЕсли РежимДобавления = "Передача" Тогда
		
		ПараметрыПакета.ТипЗаполнения = "СписатьПакет";
		ПараметрыПакета.Количество = Объект.КоличествоПередача;
		ПараметрыПакета.Номенклатура = Объект.Номенклатура;
		ПараметрыПакета.Период = Период;
		ПараметрыПакета.СерийныйНомер = Объект.СерийныйНомерПередача;
		ПараметрыПакета.Сертификат = Объект.СертификатПередача;
		ПараметрыПакета.Характеристика = Объект.ХарактеристикаПередача;	
		ПараметрыПакета.Склад = Объект.Участок.СкладСписания;
		
	КонецЕсли;
		
	ОбъектДокументПроизводства = ДокументТекущегоПроизводства.Ссылка.ПолучитьОбъект();
	ОбъектДокументПроизводства.Заполнить(ПараметрыПакета);
		
	Попытка
		ОбъектДокументПроизводства.Записать(РежимЗаписиДокумента.Проведение);	
		//Очистим количество чтобы немогли повторно нажать на кнопку создания без перезаполнения данных
		Объект.Количество = 0;
	Исключение
		Сообщить(ОписаниеОшибки());
		Успех = Ложь;
		УспехПередано = Ложь;
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПакетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВводаЧисла(НомерПакета);	
КонецПроцедуры

&НаКлиенте
Процедура ВызовФормыВводаЧисла(ТекущееЧисло)             		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущееЧисло", ТекущееЧисло);	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводЧислаЗавершено", ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.алк_ФормаВводаЧисла", ПараметрыФормы, ЭтаФорма,УникальныйИдентификатор,,, ОписаниеОповещения,);	
КонецПроцедуры

&НаКлиенте
Процедура ВводЧислаЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ВводЧислаЗавершеноНаСервере(РезультатЗакрытия); 		
	ОбновитьНадписьСечения();	
	РасчитатьОбъемКоличество(); 
	
	Если ЭтаФорма.ТекущийЭлемент.Имя = "НомерПакета" Тогда 
		Элементы.СписокПодобныхСерийныхНомеров.Обновить();
		Если Элементы.СписокПодобныхСерийныхНомеров.ТекущиеДанные = Неопределено Тогда
			Сообщить("Пакет не найден!");
			Возврат;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, Элементы.СписокПодобныхСерийныхНомеров.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВводЧислаЗавершеноНаСервере(РезультатЗакрытия)	
	Выполнить(ЭтаФорма.ТекущийЭлемент.ПутьКДанным + " = " + СтрЗаменить(СтрЗаменить(Строка(РезультатЗакрытия),",", "."), Символы.НПП, "")); 
	
	Если ЭтаФорма.ТекущийЭлемент.ПутьКДанным = "НомерПакета" Тогда 
		НомерПакетаИзменениеТекстаРедактированияНаСервере(РезультатЗакрытия)
	Иначе	
		ПолучитьХарактеристику();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШиринаНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВводаЧисла(Объект.Ширина);
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВводаЧисла(Объект.Толщина);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВводаЧисла(Объект.Количество);
КонецПроцедуры

&НаКлиенте
Процедура ОбъемНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВводаЧисла(Объект.Объем);
КонецПроцедуры
